# 7.8 *args и **kwargs Python. Передача аргументов в функцию

# Оператор *

a,b, c = 1,2,3
print(a,b,c)

a,b, c  = [True, 7, 'hello']
print(a,b,c)

# a,b,c = [True, 7, 'hello', 9, '54', 67, 4]
# print(a,b,c) # вызовет ошибку что много элементов для распаковки

a,*b,c = [True, 7, 'hello', 9, '54', 67, 4]
print(a,b,c, sep='\n')

*a,b,c = 'hello world'
print(a,b,c)

*a,b,c = [2,3]
print(a,b,c)

#================================================================================

# def f(a,b,c,d):
#     print(a,b,c,d)
#
# f(1,2,3,4)
#
# a = ('hello', True, 78, [3,4,5])
# f(*a)

#=================================================================

def f(*args):
    print(args, type(args))

f(1,2,3,4,5,6,7,8)
f(1,3)
f()


#=================================================================

def f(**kwargs):
    print(kwargs, type(kwargs))

f(a=1, b=2,c=3)


#=================================================================

def f(*args, **kwargs):
    print(args, kwargs)

f(4,3,5,6,5,a=3,c=4)


#=================================================================

def out_print(*args, sep='#', end='@'):
    print(args, sep, end)

out_print(1,2,3,4,4,5, sep=90)


#=================================================================

a = [2,3,4,4,5,6]
print(*a)




















