# 1.1 Классы, объекты, экземпляры классов

# Создание класса

class Car:
    model = "BMW"
    engine = 1.6


# =================================================================

"""Настало время создать наш первый класс под названием Factory

Ваша задача просто создать пустой класс, больше ничего внутри него 
делать не нужно"""


class Factory:
    pass

# ===================================================================

"""Создайте класс Contact, у которого есть:

атрибут name, со значением 'Barak'
атрибут phone_number, со значением '+1 202 345 4564'
Создайте ЭК и сохраните его в переменную b"""

class Contact:
    name = 'Barak'
    phone_number = '+1 202 345 4564'

b = Contact()








