#  литералы и символьный класс

import re

text = "Еда, беду, победа"
# Будет искать все слова с еда, Еда, еду, Еду
match = re.findall(r"[еЕ]д[ау]", text)
print(match)

#===================================================================

text = "Еда, беду, 33 55победа"
# Будет искать все содержание хотя бы одной цифры
match = re.findall(r"[0123456789]", text)

print(match)

#===================================================================


text = "Еда, беду, 4 33 55победа"
# Будет искать все содержание подряд две цифры
match = re.findall(r"[0123456789][0123456789]", text)
match1 = re.findall(r"[0-9][0-9]", text)
print(match)
print(match1)

#===================================================================

text = "Еда, беду, 33 55победа"
# Будет искать не цифры
match = re.findall(r"[^0-9]", text)

print(match)

#===================================================================

text = "Еда, беду, 33 55победа"
# Будет искать все буквы
match = re.findall(r"[а-яА-Я]", text)

print(match)

#===================================================================

text = "Еда, беду, 33 55победа"
# Будет искать все буквы и цифры
match = re.findall(r"[а-яА-Я0-9]", text)

print(match)