# Создание словаря
dict_item = {}

dict_item = {
    1: 'Julia',
    2: [1,2,3,4,56],
    3: {'name': 'Vadim', 'age':'32', 'salary':10000}
} # В словаре ключ может быть любым типом данных, переменная тоже может

# быть любым типом данных.

# print(dict_item[2]) # Вывод определенного элемента
# print(dict_item) # Вывод всего словаря
# print(3,':', dict_item[3]['name']) #Вывод значение из словаря в словаре

# x = dict_item.get(3).get('salary') # Получить данные из слова
# print(x)

#=========================================================================

#Итерирование списков с for
for key, value in dict_item.items():
    print('key', key, 'value:', value)

#Итерирование по ключам
for key in dict_item:
    print('item:', dict_item[key])

#=========================================================================

#Создаем словарь с когда на нужно одно значение присвоить нескольким
names = ('Eldar','Vadim', 'Inna', 'Dmitry')
salary = 10000
dd = dict.fromkeys(names, salary)
print(dd)

#=========================================================================

#Копирование словаря
dict_2 = dict_item.copy()
print('dict_2 ', dict_2)

#========================================================================

#Добавление элемента в словарь
dict_item['city']= 'Kislovodsk'
print(dict_item)

#========================================================================

# Изменения существующего элемента
dict_item[1] = 'Eldar'
print(dict_item)

#========================================================================

# Удаление элемента
del dict_item[2]
print(dict_item)

#=========================================================================

#Удалить последний элемент словаря
dict_item.popitem()
print(dict_item)

# Удалить определенный элемент
dict_item.pop(1)
print(dict_item)

#Удаление всего словаря
dict_item.clear()
print(dict_item)

#Посмотреть длину словаря
print(len(dict_item))




