# 4.6 Инструкции break, continue, else

# Бесконечный цикл
# while i>0:
#     print("'Iteraciya #", i)
#     i += 1


# Прерываем бесконечный цикл
# while i>0:
#     print("'Iteraciya #", i)
#     if i == 10:
#         break
#     i += 1
# print("after break")

# ====================================================================================
#
# while True:
#     a = input()
#     if a =="exit":
#         break
#     if len(a)<5:
#         continue
#     print(a, len(a))

# =====================================================================================

# a = [54,32,65,765,32,543]
#
# # Yes - все четные
# # No - в противном случае
#
# while len(a)>0:
#     last=a.pop()
#     if last%2 !=0:
#         print("No")
#         break
# else:
#     print("YES")

# ======================================================================================

# t = 7
# while t > 1:
#     t -= 1
#     if t == 3:
#         break
#     print(t)

# ============================================================================================

"""Программа получает на вход натуральное число n > 1. Выведите минимальный
делитель этого числа, отличный от единицы.

К примеру для числа 12 делителями являются 1, 2, 3, 4, 6, 12. """
n = 12
i = 2

while i>1:
    if n%i == 0:
        print(i)
        break
    i += 1

