#  5.5 Вложенные циклы

# for i in range(3):
#     for j in range(5):
#         print(j, i)
#     print()

# ==================================================================================

# Длина пароля 3. Переберем все цифры буквы и символы

# from string import printable
#
# print(printable)
#
# for b1 in printable:
#     for b2 in printable:
#         for b3 in printable:
#             print(b1, b2, b3)

# Таблица умножения

# for i in range(1,10):
#     for j in range(1,10):
#         print(j,"*",i, "=", i*j, end="  ")
#     print()

#===================================================================================

# """Сколько шестибуквенных слов, начинающихся и заканчивающихся
# согласной буквой и содержащих ровно 2 гласные, можно составить
# из букв Т, Ы, К, В, А? Каждая из допустимых букв может входить
# в слово несколько раз"""
#
# k = 0
#
# for b1 in 'tukva':
#     for b2 in 'tukva':
#         for b3 in 'tukva':
#             for b4 in 'tukva':
#                 for b5 in 'tukva':
#                     for b6 in 'tukva':
#                         rez = b1 + b2 + b3 + b4 + b5 +b6
#                         if rez[0] in 'tkv' and rez[-1] in 'tkv':
#                             if rez.count('a') + rez.count("u")==2:
#                                 k+=1
#
# print(k)

# ====================================================================================

# Можно также использовать while

# for i in range(1, 100001):
#     x = i
#     s = 0
#     while x>0:
#         s +=x%10
#         x //=10
#     print(i,s)

# =========================================================================================================

"""Найдите сумму всех четырехзначных чисел, сумма цифр каждого из которых равна 20"""

count = 0


for i in range(1000,10000):
    sum = 0
    k = i
    for j in range(1,5):
        last_digit = k % 10
        sum += last_digit
        k //=10
    if sum==20:
        print(i)
        print(sum)
        count += i

print(count)

#===========================================================================================================

"""В этой задаче вам предстоит построить лесенку из чисел. Программа принимает на вход целое 
положительное число n (n<=15) - количество уровней, ваша задача вывести n уровней, в каждом из 
которых стоят числа от 1 до значения уровня."""

n = int(input())

for i in range(1,n+1):
    for j in range(1,i+1):
        print(j, end = ' ')
    print()

